var Hospitals = [{
        "lnglat": [117.04856, 36.677351],
        "name": "山东省胸科医院",
        "number": 15168883369,
        "style": 2
    }, {
        "lnglat": [116.988004, 36.649269],
        "name": "济南市传染病医院",
        "number": 15508639120,
        "style": 2
    }, {
        "lnglat": [117.666676, 36.240698],
        "name": "济南市人民医院",
        "number": "0634-6279041",
        "style": 2
    }, {
        "lnglat": [120.327265, 36.067999],
        "name": "青岛大学附属医院（市南院区）",
        "number": 18661801111,
        "style": 2
    }, {
        "lnglat": [120.453619, 36.101875],
        "name": "青岛大学附属医院（崂山院区）",
        "number": 18661805555,
        "style": 2
    }, {
        "lnglat": [120.156892, 35.987382],
        "name": "青岛大学附属医院（西海岸院区）",
        "number": 18661806666,
        "style": 2
    }, {
        "lnglat": [120.42177, 36.113052],
        "name": "青岛山大齐鲁医院",
        "number": "0532-96599",
        "style": 2
    }, {
        "lnglat": [120.326693, 36.073444],
        "name": "青岛市市立医院（本部）",
        "number": "0532-82789302",
        "style": 2
    }, {
        "lnglat": [120.402946, 36.059331],
        "name": "青岛市市立医院（东院）",
        "number": "0532-88905677",
        "style": 2
    }, {
        "lnglat": [120.376957, 36.139824],
        "name": "青岛市中心医院",
        "number": "0532-84961699",
        "style": 2
    }, {
        "lnglat": [120.396511, 36.216124],
        "name": "青岛市胸科医院",
        "number": "0532-84816628",
        "style": 2
    }, {
        "lnglat": [120.40269, 36.097142],
        "name": "青岛市妇女儿童医院",
        "number": "0532-68661000",
        "style": 2
    }, {
        "lnglat": [120.359492, 36.094453],
        "name": "青岛市中医医院",
        "number": "0532-83777527",
        "style": 2
    }, {
        "lnglat": [118.052479, 36.807085],
        "name": "淄博市中心医院",
        "number": "0533-2360575",
        "style": 2
    }, {
        "lnglat": [117.866125, 36.492355],
        "name": "淄博市第一医院",
        "number": "0533-4252428<br>0533-4256120",
        "style": 2
    }, {
        "lnglat": [118.042576, 36.764596],
        "name": "淄博市传染病医院",
        "number": "0533-2972069",
        "style": 2
    }, {
        "lnglat": [117.972257, 36.824335],
        "name": "淄博市妇幼保健院",
        "number": "0533-2951621",
        "style": 2
    }, {
        "lnglat": [117.567335, 34.843745],
        "name": "枣庄市立医院",
        "number": "0632-3227289、3288019（白天）<br>0632-3288020（晚上）",
        "style": 2
    }, {
        "lnglat": [117.193446, 35.051616],
        "name": "枣庄市王开传染病医院",
        "number": "0632-5268121（白天）<br>0632-5268008（24小时行政值班）",
        "style": 2
    }, {
        "lnglat": [117.156721, 35.08655],
        "name": "滕州市中心人民医院",
        "number": "0632-5513457（白天）<br>0632-5512227（夜、白总值班）",
        "style": 2
    }, {
        "lnglat": [118.666995, 37.424335],
        "name": "东营市人民医院",
        "number": "0546-8331577",
        "style": 2
    }, {
        "lnglat": [118.513795, 37.462704],
        "name": "胜利油田中心医院",
        "number": "0546-8552224",
        "style": 2
    }, {
        "lnglat": [118.638089, 37.472291],
        "name": "东营胜利医院",
        "number": 13280325950,
        "style": 2
    }, {
        "lnglat": [121.408684, 37.528592],
        "name": "烟台奇山医院(传染病医院)",
        "number": "0535-6606100",
        "style": 2
    }, {
        "lnglat": [119.135452, 36.721547],
        "name": "潍坊医学院附属医院",
        "number": "0536-3081234",
        "style": 2
    }, {
        "lnglat": [119.13255, 36.69975],
        "name": "潍坊市人民医院",
        "number": "0536-8192539",
        "style": 2
    }, {
        "lnglat": [119.13857, 36.708339],
        "name": "潍坊市第二人民医院",
        "number": "0536-8233405",
        "style": 2
    }, {
        "lnglat": [119.191604, 36.686362],
        "name": "阳光融和医院",
        "number": "0536-6960114",
        "style": 2
    }, {
        "lnglat": [116.59505, 35.406596],
        "name": "济宁市传染病医院",
        "number": "0537-2048345",
        "style": 2
    }, {
        "lnglat": [116.593277, 35.397628],
        "name": "济宁市第一人民医院",
        "number": "0537-2253423",
        "style": 2
    }, {
        "lnglat": [116.696667, 35.41035],
        "name": "济宁市第一人民医院",
        "number": "0537-2253423",
        "style": 2
    }, {
        "lnglat": [116.558296, 35.378477],
        "name": "济宁市第一人民医院",
        "number": "0537-2253423",
        "style": 2
    }, {
        "lnglat": [116.579458, 35.408031],
        "name": "济宁医学院附属医院",
        "number": "0537-2903085",
        "style": 2
    }, {
        "lnglat": [117.087312, 36.147449],
        "name": "泰安市中心医院分院",
        "number": "0538-8626089",
        "style": 2
    }, {
        "lnglat": [122.06351, 37.493611],
        "name": "威海市胸科医院",
        "number": "0631-5298877",
        "style": 2
    }, {
        "lnglat": [119.514972, 35.412767],
        "name": "日照市人民医院",
        "number": "0633-3365238",
        "style": 2
    }, {
        "lnglat": [118.349826, 35.063476],
        "name": "临沂市人民医院",
        "number": "0539-8078933",
        "style": 2
    }, {
        "lnglat": [118.632276, 35.796953],
        "name": "临沂市中心医院",
        "number": "0539-2258953",
        "style": 2
    }, {
        "lnglat": [116.306505, 37.451513],
        "name": "德州市人民医院",
        "number": "0534-2637034",
        "style": 2
    }, {
        "lnglat": [116.272914, 37.450026],
        "name": "德州市第二人民医院",
        "number": "0534-2488118",
        "style": 2
    }, {
        "lnglat": [116.007004, 36.473491],
        "name": "聊城市传染病医院",
        "number": "0635-7076135",
        "style": 2
    }, {
        "lnglat": [115.979255, 36.458438],
        "name": "聊城市人民医院",
        "number": "0635-8276114",
        "style": 2
    }, {
        "lnglat": [118.005872, 37.386877],
        "name": "滨州市人民医院",
        "number": "0543-3282825（白天）<br>0543-3282713（夜间）",
        "style": 2
    }, {
        "lnglat": [118.011243, 37.370394],
        "name": "滨州医学院附属医院",
        "number": "0543-3256719",
        "style": 2
    }, {
        "lnglat": [117.509921, 37.489877],
        "name": "滨州市中心医院",
        "number": "0543-5361273（白天）<br>0543-5322335（夜间）",
        "style": 2
    }, {
        "lnglat": [115.43861, 35.243616],
        "name": "菏泽市立医院",
        "number": 17605305120,
        "style": 2
    }, {
        "lnglat": [115.446794, 35.271038],
        "name": "菏泽市传染病医院",
        "number": "0530-5218609",
        "style": 2
    }, {
        "lnglat": [116.087303, 34.782696],
        "name": "单县中心医院",
        "number": "0530-4691777",
        "style": 2
    }
];
