var demoPoints = [{
        "date": "2020/1/29",
        "lnglat": [35.4417761255897, 116.582264941569],
        "name": "济宁市桃园社区曹西村17号楼",
        "style": 2
    }, {
        "date": "2020/1/29",
        "lnglat": [35.5657525889692, 116.981333631415],
        "name": "曲阜市圣城嘉园小区",
        "style": 2
    }, {
        "date": "2020/1/31",
        "lnglat": [35.5955580012135, 116.984905305505],
        "name": "曲阜市静轩小区",
        "style": 2
    }, {
        "date": "2020/1/31",
        "lnglat": [35.5953579732581, 116.984889485879],
        "name": "曲阜市静轩小区",
        "style": 2
    }, {
        "date": "2020/1/25",
        "lnglat": [35.6703622249837, 117.276059990082],
        "name": "济宁市泗水县天下景城小区东区",
        "style": 2
    }, {
        "date": "2020/2/1",
        "lnglat": [35.4154830341329, 116.942356491544],
        "name": "邹城市海悦小区",
        "style": 2
    }, {
        "date": "2020/2/1",
        "lnglat": [35.5914728430018, 117.01030372721],
        "name": "曲阜市体育局家属院",
        "style": 2
    }, {
        "date": "2020/2/1",
        "lnglat": [35.5541438590935, 117.049465859505],
        "name": "曲阜市息陬镇东终吉村",
        "style": 2
    }, {
        "date": "2020/2/2",
        "lnglat": [35.4311285548596, 116.657168264168],
        "name": "济宁高新区海亮公馆",
        "style": 2
    }, {
        "date": "2020/2/2",
        "lnglat": [35.4245425000083, 116.637765451016],
        "name": "济宁市任城区如意嘉园",
        "style": 2
    }, {
        "date": "2020/2/2",
        "lnglat": [35.4271778452164, 116.618518009871],
        "name": "济宁高新区洸河街道市检察院宿舍",
        "style": 2
    }, {
        "date": "2020/2/2",
        "lnglat": [35.5532949088021, 116.842436516193],
        "name": "济宁市兖州区鼓楼街道奎星苑",
        "style": 2
    }, {
        "date": "2020/1/24",
        "lnglat": [35.4497274496789, 116.63704546962],
        "name": "济宁市任城区李营街道骆楼富豪佳苑",
        "style": 2
    }, {
        "date": "2020/1/29",
        "lnglat": [35.424275047863, 116.554201955099],
        "name": "济宁市任城区南张街道鸿顺运河新城",
        "style": 2
    }, {
        "date": "2020/1/25",
        "lnglat": [35.6704189862046, 117.276075445524],
        "name": "济宁市泗水县天下景城小区东区",
        "style": 2
    }, {
        "date": "2020/2/1",
        "lnglat": [35.5916225827235, 117.010351022243],
        "name": "曲阜市体育局家属院",
        "style": 2
    }, {
        "date": "2020/2/5",
        "lnglat": [35.5537426994957, 116.842147350268],
        "name": "济宁市兖州区奎星苑小区",
        "style": 2
    }, {
        "date": "2020/2/5",
        "lnglat": [35.5535627958524, 116.842159948388],
        "name": "济宁市兖州区奎星苑小区",
        "style": 2
    }, {
        "date": "2020/2/5",
        "lnglat": [35.5538922195545, 116.842154685975],
        "name": "济宁市兖州区奎星苑小区",
        "style": 2
    }, {
        "date": "2020/2/5",
        "lnglat": [35.6105879874703, 116.633035046303],
        "name": "济宁市兖州区颜店镇李宫一村",
        "style": 2
    }, {
        "date": "2020/2/5",
        "lnglat": [35.6075478012204, 117.038378449016],
        "name": "曲阜市书院街道旧县三街",
        "style": 2
    }, {
        "date": "2020/2/5",
        "lnglat": [35.4307740232517, 116.657158224774],
        "name": "济宁市高新区海亮公馆",
        "style": 2
    }, {
        "date": "2020/2/5",
        "lnglat": [34.9744551526491, 116.410267240306],
        "name": "济宁市金乡县化雨镇吴海村",
        "style": 2
    }, {
        "date": "2020/1/26",
        "lnglat": [35.6008698462841, 117.002921393726],
        "name": "曲阜市五马祠街20号春天服饰广场店铺",
        "style": 2
    }, {
        "date": "2020/2/3",
        "lnglat": [35.4239349257595, 116.637921240189],
        "name": "济宁市任城区如意嘉园",
        "style": 2
    }, {
        "date": "2020/2/3",
        "lnglat": [35.5927843030385, 116.999901697223],
        "name": "曲阜市鲁城街道卫生局家属院",
        "style": 2
    }, {
        "date": "2020/2/3",
        "lnglat": [35.3428501847748, 116.265182495078],
        "name": "济宁市嘉祥县仲山镇仲山西村",
        "style": 2
    }, {
        "date": "2020/2/4",
        "lnglat": [35.5070242252514, 117.006560774662],
        "name": "曲阜市小雪街道武家村",
        "style": 2
    }, {
        "date": "2020/2/4",
        "lnglat": [35.7240847152988, 116.499087670632],
        "name": "济宁市汶上县信合小区",
        "style": 2
    }, {
        "date": "2020/2/5",
        "lnglat": [35.5537819414553, 116.84213692438],
        "name": "济宁市兖州区奎星苑小区",
        "style": 2
    }, {
        "date": "2020/2/5",
        "lnglat": [35.5538709562912, 116.84212575804],
        "name": "济宁市兖州区奎星苑小区",
        "style": 2
    }
];
