var demoPoints = [{
        "date": "",
        "lnglat": [118.33876, 35.126823],
        "name": "山东省临沂市兰山区柳青街道",
        "style": 2
    }, {
        "date": "",
        "lnglat": [118.332458, 35.064812],
        "name": "山东省临沂市兰山区银雀山街道",
        "style": 2
    }, {
        "date": "",
        "lnglat": [118.315491, 35.08971],
        "name": "山东省临沂市兰山区兰山街道",
        "style": 2
    }, {
        "date": "",
        "lnglat": [118.35125, 35.046341],
        "name": "山东省临沂市兰山区金雀山街道",
        "style": 2
    }, {
        "date": "",
        "lnglat": [118.391769, 35.068211],
        "name": "山东省临沂市河东区九曲街道",
        "style": 2
    }, {
        "date": "",
        "lnglat": [118.695236, 35.12698],
        "name": "山东省临沂市莒南县板泉镇",
        "style": 2
    }, {
        "date": "",
        "lnglat": [118.83543, 35.17486],
        "name": "山东省临沂市莒南县坪山镇",
        "style": 2
    }, {
        "date": "",
        "lnglat": [118.134743, 35.203388],
        "name": "山东省临沂市费县探沂镇",
        "style": 2
    }, {
        "date": "",
        "lnglat": [118.662552, 34.91687],
        "name": "山东省临沂市临沭县临沭街道",
        "style": 2
    }, {
        "date": "",
        "lnglat": [118.078629, 34.860512],
        "name": "山东省临沂市兰陵县卞庄街道",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.7668, 35.52396],
        "name": "山东省临沂市平邑县柏林镇",
        "style": 2
    }, {
        "date": "",
        "lnglat": [118.622437, 35.72443],
        "name": "山东省临沂市沂水县许家湖镇",
        "style": 2
    }, {
        "date": "",
        "lnglat": [118.688271, 35.894939],
        "name": "山东省临沂市沂水县道托镇",
        "style": 2
    }, {
        "date": "",
        "lnglat": [118.471672, 35.60627],
        "name": "山东省临沂市沂南县铜井镇",
        "style": 2
    }, {
        "date": "",
        "lnglat": [118.438812, 34.737209],
        "name": "山东省临沂市郯城县泉源乡",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.501968, 36.018021],
        "name": "山东省泰安市新泰市羊流镇王家林村",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.762558, 35.91592],
        "name": "山东省泰安市新泰市幸福里小区对过原山东电缆厂宿舍10号楼",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.781616, 35.893799],
        "name": "山东省泰安市新泰市青云街道大洼村",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.119873, 36.1241],
        "name": "山东省泰安市高新区北集坡街道安居幸福里小区",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.116982, 36.121262],
        "name": "山东省泰安市高新区北集坡街道龙泉小区",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.148308, 36.075039],
        "name": "山东省泰安市东平县银山镇东茂王村",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.168694, 36.003841],
        "name": "山东省泰安市东平县银山镇昆山村",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.162941, 36.186329],
        "name": "山东省泰安市泰山区上高凤凰小区10号楼",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.168922, 36.195801],
        "name": "山东省泰安市泰山区上高办事处雷诺名郡",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.146033, 36.197117],
        "name": "山东省泰安市泰山区丽景花园小区1期6号楼",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.1418, 36.188389],
        "name": "山东省泰安市泰山区岱庙办事处东湖小区",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.150083, 36.190367],
        "name": "山东省泰安市泰山区岱庙办事处杏林佳苑2号楼",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.151062, 36.193859],
        "name": "山东省泰安市泰山区岱庙街道温泉路国土资源局宿舍1号楼",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.110513, 36.200857],
        "name": "山东省泰安市泰山区擂鼓石花园10号楼",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.126432, 36.206798],
        "name": "山东省泰安市泰山区泰前办事处军星花园",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.126432, 36.206798],
        "name": "山东省泰安市泰山区泰前办事处泰前西村",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.110069, 36.172321],
        "name": "山东省泰安市泰山区泮河大街老儿童医院宿舍",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.753021, 36.225681],
        "name": "山东省泰安市肥城市大封矿宿舍18号楼",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.818108, 35.76897],
        "name": "山东省泰安市宁阳县文庙街道锦绣城1号楼",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.01874, 36.65865],
        "name": "山东省济南市历下区趵突泉小区一区",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.07972, 36.654018],
        "name": "山东省济南市历下区姚家街道窑头小区",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.0504, 36.675165],
        "name": "山东省济南市历下区利农庄23号",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.981369, 36.609737],
        "name": "山东省济南市市中区中海国际社区A2区",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.979805, 36.609718],
        "name": "山东省济南市市中区中海国际社区C2区",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.98795, 36.62988],
        "name": "山东省济南市市中区二七新村南路20号",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.998207, 36.60424],
        "name": "山东省济南市市中区十六里河街道万寿路",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.94445, 36.695732],
        "name": "山东省济南市槐荫区美里新居小区三区",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.91227, 36.67894],
        "name": "山东省济南市槐荫区锦绣兰庭小区12号楼",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.94294, 36.678539],
        "name": "山东省济南市槐荫区幸福街泉城花园",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.948715, 36.648697],
        "name": "山东省济南市槐荫区经十路25366号舜承苑西区",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.130669, 36.669563],
        "name": "山东省济南市高新区黄金时代小区",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.781082, 36.554859],
        "name": "山东省济南市长清区崮云湖乐天小区",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.059029, 36.705383],
        "name": "山东省济南市历城区锦绣澜湾小区",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.01165, 36.717396],
        "name": "山东省济南市天桥区泺口街道河畔景苑小区",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.456688, 36.274761],
        "name": "山东省济南市平阴县榆山街道龙山小区",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.418121, 36.934711],
        "name": "山东省济南市章丘区刁镇街道办季周村",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.628571, 35.418755],
        "name": "山东省济宁市任城区如意家园",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.631699, 35.417519],
        "name": "山东省济宁市任城区如意嘉园",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.714859, 35.189789],
        "name": "山东省济宁市任城区建设新村",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.575699, 35.402992],
        "name": "山东省济宁市任城区太白国际",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.833717, 35.542389],
        "name": "山东省济宁市兖州区奎星苑",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.833717, 35.542389],
        "name": "山东省济宁市兖州区奎星苑小区",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.626602, 35.60397],
        "name": "山东省济宁市兖州区颜店镇李宫一村",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.612244, 35.422066],
        "name": "山东省济宁市高新区洸河街道市检察院宿舍",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.651291, 35.4231],
        "name": "山东省济宁市高新区海亮公馆",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.258698, 35.336658],
        "name": "山东省济宁市嘉祥县仲山镇仲山西村",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.99398, 35.580349],
        "name": "山东省济宁市曲阜市鲁城街道卫生局家属院",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.001518, 35.500629],
        "name": "山东省济宁市曲阜市小雪街道武家村",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.03553, 35.60157],
        "name": "山东省济宁市曲阜市书院街道旧县三街",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.492569, 35.717823],
        "name": "山东省济宁市汶上县信合小区",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.405197, 34.96793],
        "name": "山东省济宁市金乡县化雨镇吴海村",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.872101, 36.497879],
        "name": "山东省淄博市博山区城东街道恒泰怡景",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.83812, 36.494461],
        "name": "山东省淄博市博山区域城镇颜山国际",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.873848, 36.506058],
        "name": "山东省淄博市博山区城东街道办事处青龙山鑫龙东苑",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.867027, 36.807789],
        "name": "山东省淄博市周村区青年路办事处区交通局宿舍",
        "style": 2
    }, {
        "date": "",
        "lnglat": [118.008537, 36.831921],
        "name": "山东省淄博市张店区马尚镇龙凤苑小区",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.934715, 36.978989],
        "name": "山东省淄博市桓台县新城镇邢家村",
        "style": 2
    }, {
        "date": "",
        "lnglat": [118.064598, 36.850529],
        "name": "山东省淄博市高新区石桥街道新空间花园",
        "style": 2
    }, {
        "date": "",
        "lnglat": [118.148659, 36.856651],
        "name": "山东省淄博市高新区小寨村四宝山街道",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.432549, 35.131329],
        "name": "山东省枣庄市山亭区中水峪村",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.578781, 34.77589],
        "name": "山东省枣庄市峄城区濠江花园",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.585442, 34.78265],
        "name": "山东省枣庄市峄城区前湾村坛山街道",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.151703, 34.978241],
        "name": "山东省枣庄市滕州市鲍沟镇薛中村",
        "style": 2
    }, {
        "date": "",
        "lnglat": [116.989014, 35.117039],
        "name": "山东省枣庄市滕州市大坞镇大坞村",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.226768, 35.082821],
        "name": "山东省枣庄市滕州市东沙河镇党村",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.257942, 34.79155],
        "name": "山东省枣庄市薛城区临山路朝阳小区",
        "style": 2
    }, {
        "date": "",
        "lnglat": [117.304123, 34.793076],
        "name": "山东省枣庄市薛城区临城街道阳光小区",
        "style": 2
    }, {
        "date": "",
        "lnglat": [120.535042, 36.10788],
        "name": "山东省青岛市崂山区东姜外贸度假村2-西-207",
        "style": 2
    }, {
        "date": "",
        "lnglat": [119.990402, 36.752594],
        "name": "山东省青岛市平度市经济开发区前八里庄村",
        "style": 2
    }
];
